interaction_design_in_10_years.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title><span style="text-decoration:underline;">Interaction design in 10 years.</span></title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="<span style="text-decoration:underline;">Interaction design in 10 years.</span>"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-01-21T17:10+0100"/>
<meta name="author" content="Jacob Håkansson"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title"><span style="text-decoration:underline;">Interaction design in 10 years.</span></h1>

<p>by Jacob Håkansson.
</p>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 What do you think interactive technology will be like in 10 years from now (i.e. in year 2024)?</a></li>
<li><a href="#sec-2">2 What will stay the same, and what will have changed?</a></li>
<li><a href="#sec-3">3 Do you think more or less will have changed, compared with the past 10 years ago (i.e. since 2004)?</a></li>
<li><a href="#sec-4">4 Will it be different or similar to e.g. science fiction? (please refer to specific books or movies if you like!)</a></li>
<li><a href="#sec-5">5 How would you like to affect the development, as an interaction designer?</a></li>
<li><a href="#sec-6">6 Bring up hopes, wishes, fears and fantasies, but try and be as realistic as you can!</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> What do you think interactive technology will be like in 10 years from now (i.e. in year 2024)?</h2>
<div class="outline-text-2" id="text-1">

<p>  There might be a new "standard medium" for interaction, like touchscreens are
  right now. That doesn't mean that there might exist several new ways of
  interacting with computers, just that it takes a while for them to be adopted by
  a large portion of users.
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> What will stay the same, and what will have changed?</h2>
<div class="outline-text-2" id="text-2">

<p>  Keyboards will still be around, but might be less ubiquitous, depending how much
  Speech-to-text has evolved. Screens will still be everywhere but in even more
  form factors and materials.
</p></div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Do you think more or less will have changed, compared with the past 10 years ago (i.e. since 2004)?</h2>
<div class="outline-text-2" id="text-3">

<p>  I believe in the acceleration of technological advances, and as such I think
  that at least 2 (very arbitrary number) disruptive or novel interaction methods
  will have reached consumers. It will have changed more than the last 10 years.
</p></div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Will it be different or similar to e.g. science fiction? (please refer to specific books or movies if you like!)</h2>
<div class="outline-text-2" id="text-4">

<p>  Minority Report comes to mind. Projected 3D interfaces. They already exists in
  some implementations, but might be productized in the years to come. Speech
  will continue progressing, and is used in multiple sci-fi pieces, Star Trek TOS
  for example.
</p></div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> How would you like to affect the development, as an interaction designer?</h2>
<div class="outline-text-2" id="text-5">

<p>  I would love to be part of a team that works with novel interaction
  technologies, and although I don't primarily view myself as an interaction
  designer, I hope to contribute to a product or research project that changes the
  way people interact with computers.
</p></div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Bring up hopes, wishes, fears and fantasies, but try and be as realistic as you can!</h2>
<div class="outline-text-2" id="text-6">

<p>  I sincerely hope that multimodal interfaces will be more commonplace and that
  touch won't mean a picture behind glass.
</p></div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-01-21T17:10+0100</p>
<p class="author">Author: Jacob Håkansson</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
